{
  "location_id": "candlewitch_cottage",
  "name": "Candlewitch Cottage",
  "region": "Ashen Woods",
  "biome": "witch_cottage",
  "recommended_level": 5,
  "max_players": 1,
  "scaling_mode": "fixed",
  "description": "A small cottage hidden in the Ashen Woods. The interior is cluttered with jars, herbs, and tools. At first glance it looks welcoming, but several details suggest the resident is not harmless.",
  "entry_encounter_id": "candlewitch_main_room",
  "boss_encounter_id": "candlewitch_main_room",
  "intro_brief": {
    "title": "Nana Wick’s Hospitality",
    "narrative": "You wake up tied to a chair in a cottage that smells faintly of sugar, herbs, and bad decisions. Nana Wick greets you like an overdue guest — warm smile, sharp eyes, and absolutely no explanation.\n\nYou don’t know how long you’ve been here, but you’re certain of two things:\n1. Nana Wick is in control.\n2. Staying much longer is a terrible idea.\n\nYour objective is to free yourself and escape the cottage. You can bargain, lie, charm, sneak, or make a mess — just be careful. Nana Wick has done this before, and she’s very curious to see how you’ll try."
  },
  "encounters": [
    {
      "encounter_id": "candlewitch_main_room",
      "title": "Nana Wick’s Hospitality",
      "type": "social",
      "difficulty": "normal",
      "description": "The player wakes bound to a wooden chair in the center of the cottage. A cauldron simmers nearby. Shelves are crowded with jars, tools, and dried plants. Nana Wick watches the player calmly. An enchanted broom rests against a wall.",
      "environment": {
        "location_hint": "indoor cottage room",
        "lighting": "warm candlelight",
        "terrain": "wooden floor with narrow walkways between shelves; central hearth area",
        "ambience": "quiet room sounds: bubbling cauldron, soft house creaks, occasional broom shifts"
      },
      "objectives": [
        {
          "id": "escape_bonds",
          "description": "Free yourself from the chair or loosen the restraints.",
          "required": true
        },
        {
          "id": "leave_cottage",
          "description": "Exit the cottage safely without being stopped by Nana Wick.",
          "required": true
        }
      ],
      "enemies": [
        {
          "enemy_id": "nana_wick",
          "name": "Nana Wick",
          "is_boss": true,
          "description": "An elderly cottage witch with candlewax-stained clothing. Calm demeanor, watchful eyes, and subtle magical presence.",
          "stats": { "hp": 22, "pow": 1, "agi": 1, "mag": 4, "ins": 3, "chr": 4 },
          "abilities": ["Binding Candleflame", "Sugared Words", "Ashen Hex"],
          "behavior": "Starts friendly and composed. Deflects questions, monitors the player. Escalates to magical restraint or confrontation if threatened, if the player tries to escape too openly, or if objects are disturbed."
        }
      ],
      "npcs": [
        {
          "npc_id": "enchanted_broom",
          "name": "Brusque the Broom",
          "role": "reluctant_helper",
          "description": "A self-moving broom with limited awareness. Its bristles twitch when Nana isn’t watching.",
          "notes": "Can assist indirectly if persuaded or prompted. Capable of loosening rope fibers, moving objects, or causing small distractions. Generally cautious and somewhat grumpy."
        }
      ],
      "hazards": ["tight_bonds", "crowded_shelves", "unsteady_candles", "hot_cauldron"],
      "items": [
        {
          "item_id": "witchlight_candle",
          "name": "Witchlight Candle",
          "type": "consumable",
          "rarity": "rare",
          "description": "A small candle with an unusual flame that reacts to illusions and secrets.",
          "effect": "Once per location, it highlights a hidden detail, faint illusion, or misleading object. Also grants a strong narrative edge on INS or CHR-based attempts to detect deception."
        }
      ],
      "gm_notes": "This encounter is primarily social and escape-focused. Nana Wick’s initial behavior is calm and polite. Players may attempt to loosen their ropes, distract Nana, negotiate, lie, or involve the broom. The scene can be resolved without combat if the player is subtle. If the player becomes aggressive or reckless, transition to magical conflict. Suggested actions should stay high-level: test the ropes, distract Nana, study the shelves, whisper to the broom, look for tools, etc."
    }
  ],
  "flow": [
    {
      "from": "candlewitch_main_room",
      "to": "end",
      "condition": "Player escapes the cottage through trickery, stealth, persuasion, or direct confrontation."
    }
  ],
  "items": ["witchlight_candle"],
  "base_rewards": {
    "xp": 160,
    "gold": 50,
    "items": ["witchlight_candle"]
  }
}