{
  "location_id": "the_orcish_tavern",
  "name": "The Orcish",
  "region": "Borderlands",
  "biome": "tavern",
  "recommended_level": 2,
  "max_players": 1,
  "scaling_mode": "fixed",

  "description": "A rough tavern frequented by orcs, mercenaries, and anyone with poor judgment. Violence here is common, but rarely subtle.",

  "entry_encounter_id": "grog_the_big_main_room",
  "boss_encounter_id": "grog_the_big_main_room",

  "intro_brief": {
    "title": "Rescue at The Orcish",
    "narrative": "You were hired to track down a kidnapped maiden who vanished along the trade road. Your trail ends here, at The Orcish — a brutal tavern known to be controlled by Grog the Big, a feared orc warlord. The maiden is inside, alive but restrained. Grog is here as well, surrounded by muscle. To succeed, you’ll need to deal with Grog and get her out."
  },

  "encounters": [
    {
      "encounter_id": "grog_the_big_main_room",
      "title": "Grog the Big",
      "type": "mixed",
      "difficulty": "normal",

      "description": "The tavern’s main room is crowded and tense. A large central table dominates the space, surrounded by scarred orcs and wary patrons. Behind the bar, an orc bartender watches everything closely. Near Grog’s table, a young woman is bound and seated under guard.",

      "environment": {
        "location_hint": "orc-controlled tavern interior",
        "lighting": "dim lanterns and hearth fire",
        "terrain": "crowded tables, benches, bar counter, narrow walking paths",
        "ambience": "low orcish chatter, clinking mugs, occasional laughter that stops too abruptly"
      },

      "objectives": [
        {
          "id": "defeat_grog",
          "description": "Defeat or neutralize Grog the Big.",
          "required": true
        },
        {
          "id": "free_maiden",
          "description": "Free the captive maiden.",
          "required": true
        }
      ],

      "enemies": [
        {
          "enemy_id": "grog_the_big",
          "name": "Grog the Big",
          "is_boss": true,
          "description": "A massive orc warlord seated at the central table. Broad-shouldered, scarred, and completely at ease. He carries himself like a man who expects trouble and welcomes it.",
          "stats": { "hp": 28, "pow": 4, "agi": 1, "mag": 0, "ins": 2, "chr": 2 },
          "abilities": [
            "Crushing Blow",
            "Intimidating Presence",
            "Backhand Strike"
          ],
          "behavior": "Starts relaxed and mocking. Escalates quickly if challenged, threatened, or if the maiden is approached. Will fight openly and brutally once engaged."
        },
        {
          "enemy_id": "grog_lieutenant",
          "name": "Orc Lieutenant",
          "is_boss": false,
          "description": "A thick-necked orc seated beside Grog, watching the room with practiced suspicion.",
          "stats": { "hp": 14, "pow": 3, "agi": 1, "mag": 0, "ins": 1, "chr": 1 },
          "abilities": [
            "Shield Bash"
          ],
          "behavior": "Intervenes immediately if violence breaks out or if the player approaches the maiden."
        }
      ],

      "npcs": [
        {
          "npc_id": "orc_bartender",
          "name": "Orc Bartender",
          "role": "hostile_observer",
          "description": "A broad orc behind the bar, pretending to clean mugs while tracking every movement in the room.",
          "notes": "Will alert Grog or join the fight if combat erupts. May be distracted, intimidated, or manipulated."
        },
        {
          "npc_id": "captive_maiden",
          "name": "Captured Maiden",
          "role": "captive",
          "description": "A frightened young woman bound to a chair near Grog’s table. Alert, shaken, and watching for an opening.",
          "notes": "Can be freed quietly or during combat. Will not attempt escape without player action."
        }
      ],

      "hazards": [
        "crowded_tables",
        "narrow_walkways",
        "breakable_furniture"
      ],

      "items": [
        {
          "item_id": "barroom_knife",
          "name": "Barroom Knife",
          "type": "weapon",
          "rarity": "common",
          "description": "A heavy, chipped knife left behind by a previous patron.",
          "effect": "Improvised light weapon. Can be grabbed during the encounter."
        }
      ],

      "gm_notes": "This encounter supports multiple approaches: social manipulation, intimidation, distraction, or direct combat. Grog should feel dangerous but beatable. The maiden is visible from the start to keep stakes clear. Combat will likely draw in both orcs. The bartender should feel like a wildcard who can tip the balance."
    }
  ],

  "flow": [
    {
      "from": "grog_the_big_main_room",
      "to": "end",
      "condition": "Grog is defeated or neutralized and the maiden is freed."
    }
  ],

  "base_rewards": {
    "xp": 180,
    "gold": 60,
    "items": ["a_bottle_of_golden_ale"]
  }
}