{
  "location_id": "whispering_garden",
  "name": "Whispering Garden",
  "region": "Moonshade Vale",
  "biome": "overgrown_garden",
  "recommended_level": 5,
  "max_players": 1,
  "scaling_mode": "fixed",
  "description": "An overgrown garden overtaken by thick vines, drifting pollen, and unusual plant behavior.",
  "entry_encounter_id": "garden_outer_path",
  "boss_encounter_id": "thornmother_heartbloom",

  "intro_brief": {
    "title": "The Whispering Garden",
    "narrative": "You were sent to investigate a once-famous garden that fed half the region — a place known for impossible blooms and gentle caretakers. No shipments have arrived in weeks. Travelers report drifting pollen, tangled paths, and people who wander in… and don’t wander out.\n\nAt the heart of the garden, something has gone wrong. The plants aren’t just overgrown — they’re organized. Watchful. Protective in a way that feels learned.\n\nYour goal is to reach the source of the disturbance and quiet the Thornmother, whether by force, cleverness, or calm intervention. Until that happens, the garden will keep tightening its grip."
  },

  "encounters": [
    {
      "encounter_id": "garden_outer_path",
      "title": "Outer Garden Approach",
      "type": "environmental",
      "difficulty": "normal",
      "description": "You enter a dense garden path covered in vines and drifting pollen. Movement is partially obstructed, and signs of plant activity appear throughout the area.",
      "environment": {
        "lighting": "filtered moonlight",
        "terrain": "overgrown pathways, roots, tangled vines",
        "ambience": "distant creaking branches, drifting pollen, quiet rustling"
      },
      "objectives": [
        {
          "id": "reach_inner_garden",
          "description": "Navigate through the obstructed pathways to reach the inner garden.",
          "required": true
        }
      ],
      "enemies": [],
      "npcs": [],
      "hazards": [
        "restrictive_vines",
        "pollen_haze"
      ],
      "items": [],
      "gm_notes": "An introductory navigation encounter. The player may clear vines, avoid pollen, or use abilities to traverse the path. No combat is required."
    },
    {
      "encounter_id": "thornmother_heartbloom",
      "title": "Heart of the Garden",
      "type": "boss",
      "difficulty": "hard",
      "description": "The inner garden forms a circular clearing dominated by an oversized flowering growth at its center. Vines shift with coordinated movement indicative of a central plant intelligence.",
      "environment": {
        "lighting": "moonlit clearing",
        "terrain": "root-latticed ground, moving vines, large central bloom",
        "ambience": "steady pulse from the central plant mass, rustling foliage"
      },
      "objectives": [
        {
          "id": "quiet_the_bloom",
          "description": "Neutralize or pacify the central plant entity.",
          "required": true
        }
      ],
      "enemies": [
        {
          "enemy_id": "thornmother",
          "name": "Thornmother",
          "is_boss": true,
          "description": "A large plant-like entity controlling the garden’s growth and defensive behavior.",
          "stats": { "hp": 40, "pow": 3, "agi": 1, "mag": 4, "ins": 2, "chr": 1 },
          "abilities": [
            "Vine Lash",
            "Pollen Surge",
            "Heartbloom Pulse"
          ],
          "behavior": "Begins passively, becoming increasingly defensive as the player interferes with the bloom or approaches the center."
        }
      ],
      "npcs": [],
      "hazards": [
        "constricting_vines",
        "pollen_bursts",
        "unstable_root_platforms"
      ],
      "items": [],
      "gm_notes": "This is a single-phase boss encounter. The plant entity does not speak or reason but reacts dynamically to player actions. The player can physically damage the bloom, use abilities to disrupt its coordination, or find creative environmental solutions."
    }
  ],
  "flow": [
    {
      "from": "garden_outer_path",
      "to": "thornmother_heartbloom",
      "condition": "Upon reaching the inner clearing."
    },
    {
      "from": "thornmother_heartbloom",
      "to": "end",
      "condition": "Once the central plant entity is neutralized."
    }
  ],
  "base_rewards": {
    "xp": 240,
    "gold": 80,
    "items": []
  }
}