{
  "location_id": "whispering_garden",
  "name": "Whispering Garden",
  "region": "Moonlit Outskirts",
  "biome": "overgrown_garden",
  "recommended_level": 5,
  "max_players": 1,
  "scaling_mode": "fixed",
  "description": "An overgrown garden sealed behind an ivy-choked gate. Moonlight filters through drifting pollen, and the wind carries soft, wordless whispers. Beneath the tangled roots, something old, patient, and strangely protective seems to be watching.",
  "entry_encounter_id": "whispering_garden_gate",
  "boss_encounter_id": "whispering_garden_heart",
  "encounters": [
    {
      "encounter_id": "whispering_garden_gate",
      "title": "Gate of Pollen and Thorns",
      "type": "exploration",
      "difficulty": "normal",
      "description": "You stand before a wrought-iron gate strangled by ivy and thorny roses. Beyond the bars, a moonlit garden glows softly with drifting pollen, paths half-swallowed by creeping vines and wild blooms. The whispers on the wind grow a little louder, brushing the edge of your thoughts like someone trying to be heard from very far away.",
      "environment": {
        "location_hint": "overgrown garden entrance",
        "lighting": "cool moonlight with soft bioluminescent glow from some plants",
        "terrain": "cobbled path choked by roots, ivy-wrapped gate, dense undergrowth"
      },
      "objectives": [
        {
          "id": "open_garden_gate",
          "description": "Find a way to slip past or unravel the ivy-choked gate.",
          "required": true
        }
      ],
      "enemies": [],
      "npcs": [],
      "hazards": [
        "sleepy_pollen_clouds",
        "strangle_vines"
      ],
      "items": []
    },
    {
      "encounter_id": "whispering_garden_heart",
      "title": "Heart of the Whispering Garden",
      "type": "combat",
      "difficulty": "boss",
      "description": "Deeper inside the garden, the paths narrow into a circular glade. Vines coil along carved stone, and a mass of roots and blossoms rises from the center like an altar made of living wood. The whispers you heard at the gate swell into a layered voice—gentle, ancient, and on the verge of losing control.",
      "environment": {
        "location_hint": "inner garden glade",
        "lighting": "pale moonlight, pulsing glow from flowers and roots",
        "terrain": "circular stone platform wrapped in roots, shifting vines at the edges"
      },
      "objectives": [
        {
          "id": "quiet_the_garden",
          "description": "Calm, purify, or defeat the garden’s awakened heart before it loses control completely.",
          "required": true
        }
      ],
      "enemies": [
        {
          "enemy_id": "thornmother_core",
          "name": "Thornmother",
          "is_boss": true,
          "description": "A towering tangle of roots, blossoms, and bark shaped loosely like a woman’s upper body rising from the earth. Petals drift from her shoulders like a cloak, and her many-layered voice wavers between protective warmth and wild, choking panic.",
          "stats": {
            "hp": 45,
            "pow": 2,
            "agi": 2,
            "mag": 4,
            "ins": 4,
            "chr": 3
          },
          "abilities": [
            "Pollen Veil",
            "Strangle Vines",
            "Bloom Burst",
            "Rootbound Grasp"
          ],
          "behavior": "Opens by testing the intruder with pollen and grasping vines, more like a warning than a killing blow. As the battle continues, she grows more frantic and destructive, torn between protecting the garden and lashing out. If the player uses empathy, purification, or clever tactics, she may be calmed instead of destroyed.",
          "drops": [
            "thornmother_rosebrand",
            "petal_ward_charm"
          ]
        }
      ],
      "npcs": [],
      "hazards": [
        "pollen_choke_zones",
        "grasping_vine_rings"
      ],
      "items": [
        {
          "item_id": "thornmother_rosebrand",
          "name": "Rosebrand Blade",
          "type": "weapon",
          "rarity": "rare",
          "description": "A slender blade grown from living wood and thorns, its edge lined with crystalline petals that never wilt.",
          "effect": "Once per encounter: on a successful attack, you may choose to either deal extra damage or entangle a target in harmless vines that hinder their next action."
        },
        {
          "item_id": "petal_ward_charm",
          "name": "Petal Ward Charm",
          "type": "trinket",
          "rarity": "uncommon",
          "description": "A tiny glass vial of preserved petals that glow faintly when danger stirs.",
          "effect": "Once per Location: gain a small bonus on a saving throw or skill check to resist poison, charm, or environmental hazards like pollen or choking vines."
        }
      ]
    }
  ],
  "flow": [
    {
      "from": "whispering_garden_gate",
      "to": "whispering_garden_heart",
      "condition": "After the player opens, slips past, or otherwise bypasses the garden gate."
    },
    {
      "from": "whispering_garden_heart",
      "to": "end",
      "condition": "Once the garden’s heart is calmed, purified, or Thornmother is defeated."
    }
  ],
  "items": [
    "thornmother_rosebrand",
    "petal_ward_charm"
  ],
  "base_rewards": {
    "xp": 220,
    "gold": 70,
    "items": [
      "thornmother_rosebrand",
      "petal_ward_charm"
    ]
  }
}